{"":"DO NOT EDIT THIS FILE. ALL CHANGES WILL BE LOST ON NEXT UPGRADE. THESE ARE THE DEFAULT i18n STRINGS. TO CHANGE YOUR i18n strings, OPEN Interface:MESSAGENAME in the wiki. Thank you.","u-have-new-messages":"You have new messages","log-out":"log out","view-page":"View","edit":"Edit","view-source":"View source","history":"Revisions","no-admin-delete-page":"You need administrator access to delete pages. Sorry.","nothing-to-delete":"You need to specify something to throw in the trash.","deleted":"The page has been deleted.","delete-error":"An error occurred while deleting this page. Please check your permissions.","cant-delete-that":"You cannot delete that. Perhaps it is already deleted?","delete-confirm":"Are you sure you want to delete the page **$1**? Pages can be restored later. If this is a file page, the corresponding file will be permanently deleted.","delete-reason":"Reason for deletion:","delete-submit":"Yes, I am sure","search-query":"Search query:","redirected":"<div>Redirected from $1</div>","invalid-action-parameter":"$1 is not a recognized action.","edit-summary-label":"Briefly describe what you changed:","edit-box-label":"Page contents:","page-does-not-exist-header":"Notice: This page does not exist yet. Saving your edits will create it.","edit-header":"You are currently editing $1. Once you publish your changes, they will be publicly viewable immediately. Do not abuse this privilege.","preview":"Below is a preview. Your page has not been saved yet.","cant-edit-loginRequired":"Anonymous users are not allowed to edit pages. Please log in to edit.","cant-edit-interfaceProtected":"[[$1]] is protected because it is used in the interface. Changes to this page will impact the whole site, so it is protected from editing so only administrators can edit it.","cant-edit-notLoggedIn":"Please log in to edit pages.","cant-edit-adminProtected":"[[$1]] can only be edited by administrators. Please contact an administrator to request that they lower the protection level.","can-still-view-source":"However, you can view this page's source:","protect-instructions":"Below, you can restrict editing or creation of this page to administrators. Page protection is only recommended to stop ongoing debates or \"edit wars\", where multiple people continue reverting to their preferred version.","cant-protect-interface-page":"This page is an interface page. To prevent widespread disruption, we won't let you unprotect this page.","protect-status-protected":"This page is protected.","protect-status-unprotected":"This page is not protected.","no-page-name-to-protect":"There is nothing to protect.","page-protection-changed":"The protection status of [[$1]] was changed.","protect-reason":"Reason for protection level change:","protect-submit-button":"Change protection level","no-page-to-rollback":"You must specify a page to rollback.","rollback-header":"You can revert a page to a specific revision below. A preview is below. Please use this feature carefully!","rollback-revision-failed":"You did not specify a revision to revert to.","rollback-page-doesnt-exist":"The page you want to revert does not exist.","rollback-revision-does-not-exist":"The revision you want to revert to does not exist.","rollback-cant-revert-to-current-revision":"You cannot revert to the current revision.","rollback-summary":"Reason for rollback (optional if edit is blatant vandalism): ","rollback-submit":"Roll back","rollback-done":"<p>You have successfully reverted this page.</p>\n<p>Return to [[$2]].</p>\n<div style=\"padding: 7px; border: 1px solid;\">$1</div>","restore-this-version":"restore this version","upload-header":"Please specify a file to upload below. Please do not violate copyright by posting unauthorized copies of random files online without the appropriate licensing agreements, as those will force us to take your file down.\n\nNote that due to technical restrictions, the maximum file size is **$1** (taken directly from the PHP configuration.)\n## File upload form","file-upload-label-one":"Choose a file to upload: ", "file-upload-label-two": "Location of file on server (MUST BE UNIQUE): ","file-upload-label-one-help":"Select a file to upload. Due to technical restrictions, we cannot accept PHP files. Any other type of file is fair game for uploading.", "file-upload-label-two-help": "This is the name the file will be known on the wiki. The name of the file you are uploading on your computer will not work if you try to insert it. Only this filename can be used to insert the file (more details on that when you upload the file)", "file-upload-help": "[help]", "file-upload-details-copyright": "## Details\n### Copyright\nWe need some information to prove that we can use this file without committing copyright infringement.", "license-dropdown-label": "What license is this file available under?", "file-upload-license-dropdown-help": "A copyright license dictates what people like us can and cannot do with a copyrighted work. If there is no copyright license, then it is copyrighted with All Rights Reserved, and nobody other than the copyright holder can copy and modify it without infringing copyright. With a copyright license, what people can and cannot do depends what the license says. There are many licenses that permit commercial use and derivative works (called free licenses or free cultural licenses). A few of these are in the dropdown. If your free license is not in the dropdown, then please select the last option and add the licensing information in the description text box below.", "license-list": "Public domain because it is a work of the US Government\nPublic domain because it is a work of the US Military\nPublic domain because it was released by author\nPublic domain because it is ineligible for copyright\nPublic domain for some other reason\nCreative Commons Attribution-ShareAlike 4.0\nCreative Commons Attribution-ShareAlike 3.0\nCreative Commons Attribution-ShareAlike 2.5\nCreative Commons Attribution-ShareAlike 2.0\nCreative Commons Attribution-ShareAlike 1.0\nCreative Commons Attribution 4.0\nCreative Commons Attribution 3.0\nCreative Commons Attribution 2.5\nCreative Commons Attribution 2.0\nCreative Commons Attribution 1.0\nGNU General Public License, version 1 only\nGNU General Public License, version 1 or later\nGNU General Public License, version 2 only\nGNU General Public License, version 2 or later\nGNU General Public License, version 3 only\nGNU General Public License, version 3 or later\nGNU Affero General Public License, version 3 only\nGNU Affero General Public License, version 3 or later\nGNU Free Documentation License 1.2 only\nGNU Free Documentation License 1.2 or later\nGNU Free Documentation License 1.3 only\nGNU Free Documentation License 1.3 or later\nOther free license (license is in description)","file-upload-license-placeholder": "Choose a license", "file-upload-description-heading": "### Description", "file-upload-description-label": "Enter a few details about your file: ", "file-upload-description-help": "Please try to include enough information so that some random person who visited your file on accident can find out what it is. Also, if you did not choose a license above, please indicate which license the file is licensed under here.", "file-upload-submit": "Begin upload", "upload-please-login": "Please log in to upload files.", "file-upload-failed": "An error occurred while uploading your file. Sorry! This could be because your file was over the maximum file size permitted by the server, which should be shown below.", "invalid-extension": "<div class=\"error\">Warning while parsing configuration file: Extension $1 does not exist. Please contact the system administrator to have them fix the problem.</div>", "malformed-extension": "<div class=\"error\">Warning: Extension $1 could not be loaded because an index.php file could not be located in its directory. Please contact a system administrator to have them fix this problem.</div>", "page-index-rebuild-intro": "Welcome to the tool for rebuilding page indexes.\n\nSometimes, careless system administrators will accidentally overwrite the pages/page2ID.json file while upgrading, which erases all pages. Use the tool below to:\n * Add a title.txt to all pages, which contains the page's title.\n * Add pages which have a title.txt and are not in page2ID.json to page2ID.json.\n * Remove pages which are in page2ID.json that don't actually exist.\n\nThis process may take a while depending on the number of pages on this wiki.", "page-index-rebuild-submit": "Start process", "page-index-rebuild-start": "Page index rebuild started", "page-index-rebuild-stage1": "Stage 1: Removing nonexistent indexes", "page-index-rebuild-stage1-checking": "[$3 / $4] Checking index $2 (points to page $1)", "page-index-rebuild-stage1-pass": "Passed check", "page-index-rebuild-stage1-fail": "Points to nonexistent page, removing."}
