{"":"DO NOT EDIT THIS FILE. ALL CHANGES WILL BE LOST ON NEXT UPGRADE. THESE ARE THE DEFAULT i18n STRINGS. TO CHANGE YOUR i18n strings, OPEN Interface:MESSAGENAME in the wiki. Thank you.","u-have-new-messages":"You have new messages","log-out":"log out","view-page":"View","edit":"Edit","view-source":"View source","history":"Revisions","no-admin-delete-page":"You need administrator access to delete pages. Sorry.","nothing-to-delete":"You need to specify something to throw in the trash.","deleted":"The page has been deleted.","delete-error":"An error occurred while deleting this page. Please check your permissions.","cant-delete-that":"You cannot delete that. Perhaps it is already deleted?","delete-confirm":"Are you sure you want to delete the page **$1**? Pages can be restored later. If this is a file page, the corresponding file will be permanently deleted.","delete-reason":"Reason for deletion:","delete-submit":"Yes, I am sure","search-query":"Search query:","redirected":"Redirected from $1","invalid-action-parameter":"$1 is not a recognized action.","edit-summary-label":"Briefly describe what you changed:","edit-box-label":"Page contents:","page-does-not-exist-header":"Notice: This page does not exist yet. Saving your edits will create it.","edit-header":"You are currently editing $1. Once you publish your changes, they will be publicly viewable immediately. Do not abuse this privilege.","preview":"Below is a preview. Your page has not been saved yet.","cant-edit-loginRequired":"Anonymous users are not allowed to edit pages. Please log in to edit.","cant-edit-interfaceProtected":"[[$1]] is protected because it is used in the interface. Changes to this page will impact the whole site, so it is protected from editing so only administrators can edit it.","cant-edit-notLoggedIn":"Please log in to edit pages.","cant-edit-adminProtected":"[[$1]] can only be edited by administrators. Please contact an administrator to request that they lower the protection level.","can-still-view-source":"However, you can view this page's source:","protect-instructions":"Below, you can restrict editing or creation of this page to administrators. Page protection is only recommended to stop ongoing debates or \"edit wars\", where multiple people continue reverting to their preferred version.","cant-protect-interface-page":"This page is an interface page. To prevent widespread disruption, we won't let you unprotect this page.","protect-status-protected":"This page is protected.","protect-status-unprotected":"This page is not protected.","no-page-name-to-protect":"There is nothing to protect.","page-protection-changed":"The protection status of [[$1]] was changed.","protect-reason":"Reason for protection level change:","protect-submit-button":"Change protection level","no-page-to-rollback":"You must specify a page to rollback.","rollback-header":"You can revert a page to a specific revision below. A preview is below. Please use this feature carefully!","rollback-revision-failed":"You did not specify a revision to revert to.","rollback-page-doesnt-exist":"The page you want to revert does not exist.","rollback-revision-does-not-exist":"The revision you want to revert to does not exist.","rollback-cant-revert-to-current-revision":"You cannot revert to the current revision.","rollback-summary":"Reason for rollback (optional if edit is blatant vandalism): ","rollback-submit":"Roll back","rollback-done":"<p>You have successfully reverted this page.</p>\n<p>Return to [[$2]].</p>\n<div style=\"padding: 7px; border: 1px solid;\">$1</div>","restore-this-version":"restore this version"}